Merge pull request #2 from kangclzjc/feat/litellm-gateway
Feat/litellm gateway
